// TinySegmenter.cpp: TinySegmenter クラスのインプリメンテーション
//
//////////////////////////////////////////////////////////////////////

#include "comm.h"
#include "TinySegmenter.h"

//数字が途中できられてしまう問題への対処
//です。わずか -> です | 。わずか と。がきられないときがあったので修正。
//オリジナルを使う場合これを消す.
#define ENABLE_ENGINE_FIX

//////////////////////////////////////////////////////////////////////
// 構築/消滅
//////////////////////////////////////////////////////////////////////




#define issjiskanji(c)	((0x81 <= (unsigned char)(c&0xff) && (unsigned char)(c&0xff) <= 0x9f) || (0xe0 <= (unsigned char)(c&0xff) && (unsigned char)(c&0xff) <= 0xfc))


TinySegmenter::TinySegmenter()
{
	
	this->BIAS__ = -332;
	BC1__["HH"]=6;BC1__["II"]=2461;BC1__["KH"]=406;BC1__["OH"]=-1378;
	BC2__["AA"]=-3267;BC2__["AI"]=2744;BC2__["AN"]=-878;BC2__["HH"]=-4070;BC2__["HM"]=-1711;BC2__["HN"]=4012;BC2__["HO"]=3761;BC2__["IA"]=1327;BC2__["IH"]=-1184;BC2__["II"]=-1332;BC2__["IK"]=1721;BC2__["IO"]=5492;BC2__["KI"]=3831;BC2__["KK"]=-8741;BC2__["MH"]=-3132;BC2__["MK"]=3334;BC2__["OO"]=-2920;
	BC3__["HH"]=996;BC3__["HI"]=626;BC3__["HK"]=-721;BC3__["HN"]=-1307;BC3__["HO"]=-836;BC3__["IH"]=-301;BC3__["KK"]=2762;BC3__["MK"]=1079;BC3__["MM"]=4034;BC3__["OA"]=-1652;BC3__["OH"]=266;
	BP1__["BB"]=295;BP1__["OB"]=304;BP1__["OO"]=-125;BP1__["UB"]=352;
	BP2__["BO"]=60;BP2__["OO"]=-1762;
	BQ1__["BHH"]=1150;BQ1__["BHM"]=1521;BQ1__["BII"]=-1158;BQ1__["BIM"]=886;BQ1__["BMH"]=1208;BQ1__["BNH"]=449;BQ1__["BOH"]=-91;BQ1__["BOO"]=-2597;BQ1__["OHI"]=451;BQ1__["OIH"]=-296;BQ1__["OKA"]=1851;BQ1__["OKH"]=-1020;BQ1__["OKK"]=904;BQ1__["OOO"]=2965;
	BQ2__["BHH"]=118;BQ2__["BHI"]=-1159;BQ2__["BHM"]=466;BQ2__["BIH"]=-919;BQ2__["BKK"]=-1720;BQ2__["BKO"]=864;BQ2__["OHH"]=-1139;BQ2__["OHM"]=-181;BQ2__["OIH"]=153;BQ2__["UHI"]=-1146;
	BQ3__["BHH"]=-792;BQ3__["BHI"]=2664;BQ3__["BII"]=-299;BQ3__["BKI"]=419;BQ3__["BMH"]=937;BQ3__["BMM"]=8335;BQ3__["BNN"]=998;BQ3__["BOH"]=775;BQ3__["OHH"]=2174;BQ3__["OHM"]=439;BQ3__["OII"]=280;BQ3__["OKH"]=1798;BQ3__["OKI"]=-793;BQ3__["OKO"]=-2242;BQ3__["OMH"]=-2402;BQ3__["OOO"]=11699;
	BQ4__["BHH"]=-3895;BQ4__["BIH"]=3761;BQ4__["BII"]=-4654;BQ4__["BIK"]=1348;BQ4__["BKK"]=-1806;BQ4__["BMI"]=-3385;BQ4__["BOO"]=-12396;BQ4__["OAH"]=926;BQ4__["OHH"]=266;BQ4__["OHK"]=-2036;BQ4__["ONN"]=-973;
	BW1__[",と"]=660;BW1__[",同"]=727;BW1__["B1あ"]=1404;BW1__["B1同"]=542;BW1__["、と"]=660;BW1__["、同"]=727;BW1__["」と"]=1682;BW1__["あっ"]=1505;BW1__["いう"]=1743;BW1__["いっ"]=-2055;BW1__["いる"]=672;BW1__["うし"]=-4817;BW1__["うん"]=665;BW1__["から"]=3472;BW1__["がら"]=600;BW1__["こう"]=-790;BW1__["こと"]=2083;BW1__["こん"]=-1262;BW1__["さら"]=-4143;BW1__["さん"]=4573;BW1__["した"]=2641;BW1__["して"]=1104;BW1__["すで"]=-3399;BW1__["そこ"]=1977;BW1__["それ"]=-871;BW1__["たち"]=1122;BW1__["ため"]=601;BW1__["った"]=3463;BW1__["つい"]=-802;BW1__["てい"]=805;BW1__["てき"]=1249;BW1__["でき"]=1127;BW1__["です"]=3445;BW1__["では"]=844;BW1__["とい"]=-4915;BW1__["とみ"]=1922;BW1__["どこ"]=3887;BW1__["ない"]=5713;BW1__["なっ"]=3015;BW1__["など"]=7379;BW1__["なん"]=-1113;BW1__["にし"]=2468;BW1__["には"]=1498;BW1__["にも"]=1671;BW1__["に対"]=-912;BW1__["の一"]=-501;BW1__["の中"]=741;BW1__["ませ"]=2448;BW1__["まで"]=1711;BW1__["まま"]=2600;BW1__["まる"]=-2155;BW1__["やむ"]=-1947;BW1__["よっ"]=-2565;BW1__["れた"]=2369;BW1__["れで"]=-913;BW1__["をし"]=1860;BW1__["を見"]=731;BW1__["亡く"]=-1886;BW1__["京都"]=2558;BW1__["取り"]=-2784;BW1__["大き"]=-2604;BW1__["大阪"]=1497;BW1__["平方"]=-2314;BW1__["引き"]=-1336;BW1__["日本"]=-195;BW1__["本当"]=-2423;BW1__["毎日"]=-2113;BW1__["目指"]=-724;BW1__["Ｂ１あ"]=1404;BW1__["Ｂ１同"]=542;BW1__["｣と"]=1682;
	BW2__[".."]=-11822;BW2__["11"]=-669;BW2__["――"]=-5730;BW2__["??"]=-13175;BW2__["いう"]=-1609;BW2__["うか"]=2490;BW2__["かし"]=-1350;BW2__["かも"]=-602;BW2__["から"]=-7194;BW2__["かれ"]=4612;BW2__["がい"]=853;BW2__["がら"]=-3198;BW2__["きた"]=1941;BW2__["くな"]=-1597;BW2__["こと"]=-8392;BW2__["この"]=-4193;BW2__["させ"]=4533;BW2__["され"]=13168;BW2__["さん"]=-3977;BW2__["しい"]=-1819;BW2__["しか"]=-545;BW2__["した"]=5078;BW2__["して"]=972;BW2__["しな"]=939;BW2__["その"]=-3744;BW2__["たい"]=-1253;BW2__["たた"]=-662;BW2__["ただ"]=-3857;BW2__["たち"]=-786;BW2__["たと"]=1224;BW2__["たは"]=-939;BW2__["った"]=4589;BW2__["って"]=1647;BW2__["っと"]=-2094;BW2__["てい"]=6144;BW2__["てき"]=3640;BW2__["てく"]=2551;BW2__["ては"]=-3110;BW2__["ても"]=-3065;BW2__["でい"]=2666;BW2__["でき"]=-1528;BW2__["でし"]=-3828;BW2__["です"]=-4761;BW2__["でも"]=-4203;BW2__["とい"]=1890;BW2__["とこ"]=-1746;BW2__["とと"]=-2279;BW2__["との"]=720;BW2__["とみ"]=5168;BW2__["とも"]=-3941;BW2__["ない"]=-2488;BW2__["なが"]=-1313;BW2__["など"]=-6509;BW2__["なの"]=2614;BW2__["なん"]=3099;BW2__["にお"]=-1615;BW2__["にし"]=2748;BW2__["にな"]=2454;BW2__["によ"]=-7236;BW2__["に対"]=-14943;BW2__["に従"]=-4688;BW2__["に関"]=-11388;BW2__["のか"]=2093;BW2__["ので"]=-7059;BW2__["のに"]=-6041;BW2__["のの"]=-6125;BW2__["はい"]=1073;BW2__["はが"]=-1033;BW2__["はず"]=-2532;BW2__["ばれ"]=1813;BW2__["まし"]=-1316;BW2__["まで"]=-6621;BW2__["まれ"]=5409;BW2__["めて"]=-3153;BW2__["もい"]=2230;BW2__["もの"]=-10713;BW2__["らか"]=-944;BW2__["らし"]=-1611;BW2__["らに"]=-1897;BW2__["りし"]=651;BW2__["りま"]=1620;BW2__["れた"]=4270;BW2__["れて"]=849;BW2__["れば"]=4114;BW2__["ろう"]=6067;BW2__["われ"]=7901;BW2__["を通"]=-11877;BW2__["んだ"]=728;BW2__["んな"]=-4115;BW2__["一人"]=602;BW2__["一方"]=-1375;BW2__["一日"]=970;BW2__["一部"]=-1051;BW2__["上が"]=-4479;BW2__["会社"]=-1116;BW2__["出て"]=2163;BW2__["分の"]=-7758;BW2__["同党"]=970;BW2__["同日"]=-913;BW2__["大阪"]=-2471;BW2__["委員"]=-1250;BW2__["少な"]=-1050;BW2__["年度"]=-8669;BW2__["年間"]=-1626;
		BW2__["府県"]=-2363;BW2__["手権"]=-1982;BW2__["新聞"]=-4066;BW2__["日新"]=-722;BW2__["日本"]=-7068;BW2__["日米"]=3372;BW2__["曜日"]=-601;BW2__["朝鮮"]=-2355;BW2__["本人"]=-2697;BW2__["東京"]=-1543;BW2__["然と"]=-1384;BW2__["社会"]=-1276;BW2__["立て"]=-990;BW2__["第に"]=-1612;BW2__["米国"]=-4268;BW2__["１１"]=-669;
	BW3__["あた"]=-2194;BW3__["あり"]=719;BW3__["ある"]=3846;BW3__["い."]=-1185;BW3__["い。"]=-1185;BW3__["いい"]=5308;BW3__["いえ"]=2079;BW3__["いく"]=3029;BW3__["いた"]=2056;BW3__["いっ"]=1883;BW3__["いる"]=5600;BW3__["いわ"]=1527;BW3__["うち"]=1117;BW3__["うと"]=4798;BW3__["えと"]=1454;BW3__["か."]=2857;BW3__["か。"]=2857;BW3__["かけ"]=-743;BW3__["かっ"]=-4098;BW3__["かに"]=-669;BW3__["から"]=6520;BW3__["かり"]=-2670;BW3__["が;BW3__["]=1816;BW3__["が、"]=1816;BW3__["がき"]=-4855;BW3__["がけ"]=-1127;BW3__["がっ"]=-913;BW3__["がら"]=-4977;BW3__["がり"]=-2064;BW3__["きた"]=1645;BW3__["けど"]=1374;BW3__["こと"]=7397;BW3__["この"]=1542;BW3__["ころ"]=-2757;BW3__["さい"]=-714;BW3__["さを"]=976;BW3__["し,"]=1557;BW3__["し、"]=1557;BW3__["しい"]=-3714;BW3__["した"]=3562;BW3__["して"]=1449;BW3__["しな"]=2608;BW3__["しま"]=1200;BW3__["す."]=-1310;BW3__["す。"]=-1310;BW3__["する"]=6521;BW3__["ず;BW3__["]=3426;BW3__["ず、"]=3426;BW3__["ずに"]=841;BW3__["そう"]=428;BW3__["た."]=8875;BW3__["た。"]=8875;BW3__["たい"]=-594;BW3__["たの"]=812;BW3__["たり"]=-1183;BW3__["たる"]=-853;BW3__["だ."]=4098;BW3__["だ。"]=4098;BW3__["だっ"]=1004;BW3__["った"]=-4748;BW3__["って"]=300;BW3__["てい"]=6240;BW3__["てお"]=855;BW3__["ても"]=302;BW3__["です"]=1437;BW3__["でに"]=-1482;BW3__["では"]=2295;BW3__["とう"]=-1387;BW3__["とし"]=2266;BW3__["との"]=541;BW3__["とも"]=-3543;BW3__["どう"]=4664;BW3__["ない"]=1796;BW3__["なく"]=-903;BW3__["など"]=2135;BW3__["に;BW3__["]=-1021;BW3__["に、"]=-1021;BW3__["にし"]=1771;BW3__["にな"]=1906;BW3__["には"]=2644;BW3__["の;BW3__["]=-724;BW3__["の、"]=-724;BW3__["の子"]=-1000;BW3__["は,"]=1337;BW3__["は、"]=1337;BW3__["べき"]=2181;BW3__["まし"]=1113;BW3__["ます"]=6943;BW3__["まっ"]=-1549;BW3__["まで"]=6154;BW3__["まれ"]=-793;BW3__["らし"]=1479;BW3__["られ"]=6820;BW3__["るる"]=3818;BW3__["れ,"]=854;BW3__["れ、"]=854;BW3__["れた"]=1850;BW3__["れて"]=1375;BW3__["れば"]=-3246;BW3__["れる"]=1091;BW3__["われ"]=-605;BW3__["んだ"]=606;BW3__["んで"]=798;BW3__["カ月"]=990;BW3__["会議"]=860;BW3__["入り"]=1232;
		BW3__["大"]=2217;BW3__["始め"]=1681;BW3__["市"]=965;BW3__["新聞"]=-5055;BW3__["日,"]=974;BW3__["日、"]=974;BW3__["社会"]=2024;BW3__["ｶ月"]=990;
	TC1__["AAA"]=1093;TC1__["HHH"]=1029;TC1__["HHM"]=580;TC1__["HII"]=998;TC1__["HOH"]=-390;TC1__["HOM"]=-331;TC1__["IHI"]=1169;TC1__["IOH"]=-142;TC1__["IOI"]=-1015;TC1__["IOM"]=467;TC1__["MMH"]=187;TC1__["OOI"]=-1832;
	TC2__["HHO"]=2088;TC2__["HII"]=-1023;TC2__["HMM"]=-1154;TC2__["IHI"]=-1965;TC2__["KKH"]=703;TC2__["OII"]=-2649;
	TC3__["AAA"]=-294;TC3__["HHH"]=346;TC3__["HHI"]=-341;TC3__["HII"]=-1088;TC3__["HIK"]=731;TC3__["HOH"]=-1486;TC3__["IHH"]=128;TC3__["IHI"]=-3041;TC3__["IHO"]=-1935;TC3__["IIH"]=-825;TC3__["IIM"]=-1035;TC3__["IOI"]=-542;TC3__["KHH"]=-1216;TC3__["KKA"]=491;TC3__["KKH"]=-1217;TC3__["KOK"]=-1009;TC3__["MHH"]=-2694;TC3__["MHM"]=-457;TC3__["MHO"]=123;TC3__["MMH"]=-471;TC3__["NNH"]=-1689;TC3__["NNO"]=662;TC3__["OHO"]=-3393;
	TC4__["HHH"]=-203;TC4__["HHI"]=1344;TC4__["HHK"]=365;TC4__["HHM"]=-122;TC4__["HHN"]=182;TC4__["HHO"]=669;TC4__["HIH"]=804;TC4__["HII"]=679;TC4__["HOH"]=446;TC4__["IHH"]=695;TC4__["IHO"]=-2324;TC4__["IIH"]=321;TC4__["III"]=1497;TC4__["IIO"]=656;TC4__["IOO"]=54;TC4__["KAK"]=4845;TC4__["KKA"]=3386;TC4__["KKK"]=3065;TC4__["MHH"]=-405;TC4__["MHI"]=201;TC4__["MMH"]=-241;TC4__["MMM"]=661;TC4__["MOM"]=841;
	TQ1__["BHHH"]=-227;TQ1__["BHHI"]=316;TQ1__["BHIH"]=-132;TQ1__["BIHH"]=60;TQ1__["BIII"]=1595;TQ1__["BNHH"]=-744;TQ1__["BOHH"]=225;TQ1__["BOOO"]=-908;TQ1__["OAKK"]=482;TQ1__["OHHH"]=281;TQ1__["OHIH"]=249;TQ1__["OIHI"]=200;TQ1__["OIIH"]=-68;
	TQ2__["BIHH"]=-1401;TQ2__["BIII"]=-1033;TQ2__["BKAK"]=-543;TQ2__["BOOO"]=-5591;
	TQ3__["BHHH"]=478;TQ3__["BHHM"]=-1073;TQ3__["BHIH"]=222;TQ3__["BHII"]=-504;TQ3__["BIIH"]=-116;TQ3__["BIII"]=-105;TQ3__["BMHI"]=-863;TQ3__["BMHM"]=-464;TQ3__["BOMH"]=620;TQ3__["OHHH"]=346;TQ3__["OHHI"]=1729;TQ3__["OHII"]=997;TQ3__["OHMH"]=481;TQ3__["OIHH"]=623;TQ3__["OIIH"]=1344;TQ3__["OKAK"]=2792;TQ3__["OKHH"]=587;TQ3__["OKKA"]=679;TQ3__["OOHH"]=110;TQ3__["OOII"]=-685;
	TQ4__["BHHH"]=-721;TQ4__["BHHM"]=-3604;TQ4__["BHII"]=-966;TQ4__["BIIH"]=-607;TQ4__["BIII"]=-2181;TQ4__["OAAA"]=-2763;TQ4__["OAKK"]=180;TQ4__["OHHH"]=-294;TQ4__["OHHI"]=2446;TQ4__["OHHO"]=480;TQ4__["OHIH"]=-1573;TQ4__["OIHH"]=1935;TQ4__["OIHI"]=-493;TQ4__["OIIH"]=626;TQ4__["OIII"]=-4007;TQ4__["OKAK"]=-8156;
	TW1__["につい"]=-4681;TW1__["東京都"]=2026;
	TW2__["ある程"]=-2049;TW2__["いった"]=-1256;TW2__["ころが"]=-2434;TW2__["しょう"]=3873;TW2__["その後"]=-4430;TW2__["だって"]=-1049;TW2__["ていた"]=1833;TW2__["として"]=-4657;TW2__["ともに"]=-4517;TW2__["もので"]=1882;TW2__["一気に"]=-792;TW2__["初めて"]=-1512;TW2__["同時に"]=-8097;TW2__["大きな"]=-1255;TW2__["対して"]=-2721;TW2__["社会党"]=-3216;
	TW3__["いただ"]=-1734;TW3__["してい"]=1314;TW3__["として"]=-4314;TW3__["につい"]=-5483;TW3__["にとっ"]=-5989;TW3__["に当た"]=-6247;TW3__["ので;TW3__["]=-727;TW3__["ので、"]=-727;TW3__["のもの"]=-600;TW3__["れから"]=-3752;TW3__["十二月"]=-2287;
	TW4__["いう."]=8576;TW4__["いう。"]=8576;TW4__["からな"]=-2348;TW4__["してい"]=2958;TW4__["たが;TW4__["]=1516;TW4__["たが、"]=1516;TW4__["ている"]=1538;TW4__["という"]=1349;TW4__["ました"]=5543;TW4__["ません"]=1097;TW4__["ようと"]=-4258;TW4__["よると"]=5865;
	UC1__["A"]=484;UC1__["K"]=93;UC1__["M"]=645;UC1__["O"]=-505;
	UC2__["A"]=819;UC2__["H"]=1059;UC2__["I"]=409;UC2__["M"]=3987;UC2__["N"]=5775;UC2__["O"]=646;
	UC3__["A"]=-1370;UC3__["I"]=2311;
	UC4__["A"]=-2643;UC4__["H"]=1809;UC4__["I"]=-1032;UC4__["K"]=-3450;UC4__["M"]=3565;UC4__["N"]=3876;UC4__["O"]=6646;
	UC5__["H"]=313;UC5__["I"]=-1238;UC5__["K"]=-799;UC5__["M"]=539;UC5__["O"]=-831;
	UC6__["H"]=-506;UC6__["I"]=-253;UC6__["K"]=87;UC6__["M"]=247;UC6__["O"]=-387;
	UP1__["O"]=-214;
	UP2__["B"]=69;UP2__["O"]=935;
	UP3__["B"]=189;
	UQ1__["BH"]=21;UQ1__["BI"]=-12;UQ1__["BK"]=-99;UQ1__["BN"]=142;UQ1__["BO"]=-56;UQ1__["OH"]=-95;UQ1__["OI"]=477;UQ1__["OK"]=410;UQ1__["OO"]=-2422;
	UQ2__["BH"]=216;UQ2__["BI"]=113;UQ2__["OK"]=1759;
	UQ3__["BA"]=-479;UQ3__["BH"]=42;UQ3__["BI"]=1913;UQ3__["BK"]=-7198;UQ3__["BM"]=3160;UQ3__["BN"]=6427;UQ3__["BO"]=14761;UQ3__["OI"]=-827;UQ3__["ON"]=-3212;
	UW1__[","]=156;UW1__["、"]=156;UW1__["「"]=-463;UW1__["あ"]=-941;UW1__["う"]=-127;UW1__["が"]=-553;UW1__["き"]=121;UW1__["こ"]=505;UW1__["で"]=-201;UW1__["と"]=-547;UW1__["ど"]=-123;UW1__["に"]=-789;UW1__["の"]=-185;UW1__["は"]=-847;UW1__["も"]=-466;UW1__["や"]=-470;UW1__["よ"]=182;UW1__["ら"]=-292;UW1__["り"]=208;UW1__["れ"]=169;UW1__["を"]=-446;UW1__["ん"]=-137;UW1__["・"]=-135;UW1__["主"]=-402;UW1__["京"]=-268;UW1__["区"]=-912;UW1__["午"]=871;UW1__["国"]=-460;UW1__["大"]=561;UW1__["委"]=729;UW1__["市"]=-411;UW1__["日"]=-141;UW1__["理"]=361;UW1__["生"]=-408;UW1__["県"]=-386;UW1__["都"]=-718;UW1__["｢"]=-463;UW1__["･"]=-135;
	UW2__[","]=-829;UW2__["、"]=-829;UW2__["〇"]=892;UW2__["「"]=-645;UW2__["」"]=3145;UW2__["あ"]=-538;UW2__["い"]=505;UW2__["う"]=134;UW2__["お"]=-502;UW2__["か"]=1454;UW2__["が"]=-856;UW2__["く"]=-412;UW2__["こ"]=1141;UW2__["さ"]=878;UW2__["ざ"]=540;UW2__["し"]=1529;UW2__["す"]=-675;UW2__["せ"]=300;UW2__["そ"]=-1011;UW2__["た"]=188;UW2__["だ"]=1837;UW2__["つ"]=-949;UW2__["て"]=-291;UW2__["で"]=-268;UW2__["と"]=-981;UW2__["ど"]=1273;UW2__["な"]=1063;UW2__["に"]=-1764;UW2__["の"]=130;UW2__["は"]=-409;UW2__["ひ"]=-1273;UW2__["べ"]=1261;UW2__["ま"]=600;UW2__["も"]=-1263;UW2__["や"]=-402;UW2__["よ"]=1639;UW2__["り"]=-579;UW2__["る"]=-694;UW2__["れ"]=571;UW2__["を"]=-2516;UW2__["ん"]=2095;UW2__["ア"]=-587;UW2__["カ"]=306;UW2__["キ"]=568;UW2__["ッ"]=831;UW2__["三"]=-758;UW2__["不"]=-2150;UW2__["世"]=-302;UW2__["中"]=-968;UW2__["主"]=-861;UW2__["事"]=492;UW2__["人"]=-123;UW2__["会"]=978;UW2__["保"]=362;UW2__["入"]=548;UW2__["初"]=-3025;UW2__["副"]=-1566;UW2__["北"]=-3414;UW2__["区"]=-422;UW2__["大"]=-1769;UW2__["天"]=-865;UW2__["太"]=-483;UW2__["子"]=-1519;UW2__["学"]=760;UW2__["実"]=1023;UW2__["小"]=-2009;UW2__["市"]=-813;UW2__["年"]=-1060;UW2__["強"]=1067;UW2__["手"]=-1519;UW2__["揺"]=-1033;UW2__["政"]=1522;UW2__["文"]=-1355;UW2__["新"]=-1682;UW2__["日"]=-1815;UW2__["明"]=-1462;UW2__["最"]=-630;UW2__["朝"]=-1843;UW2__["本"]=-1650;UW2__["東"]=-931;UW2__["果"]=-665;UW2__["次"]=-2378;UW2__["民"]=-180;UW2__["気"]=-1740;UW2__["理"]=752;UW2__["発"]=529;UW2__["目"]=-1584;UW2__["相"]=-242;UW2__["県"]=-1165;UW2__["立"]=-763;UW2__["第"]=810;UW2__["米"]=509;UW2__["自"]=-1353;UW2__["行"]=838;UW2__["西"]=-744;UW2__["見"]=-3874;UW2__["調"]=1010;UW2__["議"]=1198;UW2__["込"]=3041;UW2__["開"]=1758;UW2__["間"]=-1257;UW2__["｢"]=-645;UW2__["｣"]=3145;UW2__["ｯ"]=831;UW2__["ｱ"]=-587;UW2__["ｶ"]=306;UW2__["ｷ"]=568;
	UW3__[","]=4889;UW3__["1"]=-800;UW3__["?"]=-1723;UW3__["、"]=4889;UW3__["々"]=-2311;UW3__["〇"]=5827;UW3__["」"]=2670;UW3__["〓"]=-3573;UW3__["あ"]=-2696;UW3__["い"]=1006;UW3__["う"]=2342;UW3__["え"]=1983;UW3__["お"]=-4864;UW3__["か"]=-1163;UW3__["が"]=3271;UW3__["く"]=1004;UW3__["け"]=388;UW3__["げ"]=401;UW3__["こ"]=-3552;UW3__["ご"]=-3116;UW3__["さ"]=-1058;UW3__["し"]=-395;UW3__["す"]=584;UW3__["せ"]=3685;UW3__["そ"]=-5228;UW3__["た"]=842;UW3__["ち"]=-521;UW3__["っ"]=-1444;UW3__["つ"]=-1081;UW3__["て"]=6167;UW3__["で"]=2318;UW3__["と"]=1691;UW3__["ど"]=-899;UW3__["な"]=-2788;UW3__["に"]=2745;UW3__["の"]=4056;UW3__["は"]=4555;UW3__["ひ"]=-2171;UW3__["ふ"]=-1798;UW3__["へ"]=1199;UW3__["ほ"]=-5516;UW3__["ま"]=-4384;UW3__["み"]=-120;UW3__["め"]=1205;UW3__["も"]=2323;UW3__["や"]=-788;UW3__["よ"]=-202;UW3__["ら"]=727;UW3__["り"]=649;UW3__["る"]=5905;UW3__["れ"]=2773;UW3__["わ"]=-1207;UW3__["を"]=6620;UW3__["ん"]=-518;UW3__["ア"]=551;UW3__["グ"]=1319;UW3__["ス"]=874;UW3__["ッ"]=-1350;UW3__["ト"]=521;UW3__["ム"]=1109;UW3__["ル"]=1591;UW3__["ロ"]=2201;UW3__["ン"]=278;UW3__["・"]=-3794;UW3__["一"]=-1619;UW3__["下"]=-1759;UW3__["世"]=-2087;UW3__["両"]=3815;UW3__["中"]=653;UW3__["主"]=-758;UW3__["予"]=-1193;UW3__["二"]=974;UW3__["人"]=2742;UW3__["今"]=792;UW3__["他"]=1889;UW3__["以"]=-1368;UW3__["低"]=811;UW3__["何"]=4265;UW3__["作"]=-361;UW3__["保"]=-2439;UW3__["元"]=4858;UW3__["党"]=3593;UW3__["全"]=1574;UW3__["公"]=-3030;UW3__["六"]=755;UW3__["共"]=-1880;UW3__["円"]=5807;UW3__["再"]=3095;UW3__["分"]=457;UW3__["初"]=2475;UW3__["別"]=1129;UW3__["前"]=2286;UW3__["副"]=4437;UW3__["力"]=365;UW3__["動"]=-949;UW3__["務"]=-1872;UW3__["化"]=1327;UW3__["北"]=-1038;UW3__["区"]=4646;UW3__["千"]=-2309;UW3__["午"]=-783;UW3__["協"]=-1006;UW3__["口"]=483;UW3__["右"]=1233;UW3__["各"]=3588;UW3__["合"]=-241;UW3__["同"]=3906;UW3__["和"]=-837;UW3__["員"]=4513;UW3__["国"]=642;UW3__["型"]=1389;UW3__["場"]=1219;UW3__["外"]=-241;UW3__["妻"]=2016;UW3__["学"]=-1356;UW3__["安"]=-423;UW3__["実"]=-1008;UW3__["家"]=1078;UW3__["小"]=-513;
		UW3__["少"]=-3102;UW3__["州"]=1155;UW3__["市"]=3197;UW3__["平"]=-1804;UW3__["年"]=2416;UW3__["広"]=-1030;UW3__["府"]=1605;UW3__["度"]=1452;UW3__["建"]=-2352;UW3__["当"]=-3885;UW3__["得"]=1905;UW3__["思"]=-1291;UW3__["性"]=1822;UW3__["戸"]=-488;UW3__["指"]=-3973;UW3__["政"]=-2013;UW3__["教"]=-1479;UW3__["数"]=3222;UW3__["文"]=-1489;UW3__["新"]=1764;UW3__["日"]=2099;UW3__["旧"]=5792;UW3__["昨"]=-661;UW3__["時"]=-1248;UW3__["曜"]=-951;UW3__["最"]=-937;UW3__["月"]=4125;UW3__["期"]=360;UW3__["李"]=3094;UW3__["村"]=364;UW3__["東"]=-805;UW3__["核"]=5156;UW3__["森"]=2438;UW3__["業"]=484;UW3__["氏"]=2613;UW3__["民"]=-1694;UW3__["決"]=-1073;UW3__["法"]=1868;UW3__["海"]=-495;UW3__["無"]=979;UW3__["物"]=461;UW3__["特"]=-3850;UW3__["生"]=-273;UW3__["用"]=914;UW3__["町"]=1215;UW3__["的"]=7313;UW3__["直"]=-1835;UW3__["省"]=792;UW3__["県"]=6293;UW3__["知"]=-1528;UW3__["私"]=4231;UW3__["税"]=401;UW3__["立"]=-960;UW3__["第"]=1201;UW3__["米"]=7767;UW3__["系"]=3066;UW3__["約"]=3663;UW3__["級"]=1384;UW3__["統"]=-4229;UW3__["総"]=1163;UW3__["線"]=1255;UW3__["者"]=6457;UW3__["能"]=725;UW3__["自"]=-2869;UW3__["英"]=785;UW3__["見"]=1044;UW3__["調"]=-562;UW3__["財"]=-733;UW3__["費"]=1777;UW3__["車"]=1835;UW3__["軍"]=1375;UW3__["込"]=-1504;UW3__["通"]=-1136;UW3__["選"]=-681;UW3__["郎"]=1026;UW3__["郡"]=4404;UW3__["部"]=1200;UW3__["金"]=2163;UW3__["長"]=421;UW3__["開"]=-1432;UW3__["間"]=1302;UW3__["関"]=-1282;UW3__["雨"]=2009;UW3__["電"]=-1045;UW3__["非"]=2066;UW3__["駅"]=1620;UW3__["１"]=-800;UW3__["｣"]=2670;UW3__["･"]=-3794;UW3__["ｯ"]=-1350;UW3__["ｱ"]=551;UW3__["ｸﾞ"]=1319;UW3__["ｽ"]=874;UW3__["ﾄ"]=521;UW3__["ﾑ"]=1109;UW3__["ﾙ"]=1591;UW3__["ﾛ"]=2201;UW3__["ﾝ"]=278;
	UW4__[","]=3930;UW4__["."]=3508;UW4__["―"]=-4841;UW4__["、"]=3930;UW4__["。"]=3508;UW4__["〇"]=4999;UW4__["「"]=1895;UW4__["」"]=3798;UW4__["〓"]=-5156;UW4__["あ"]=4752;UW4__["い"]=-3435;UW4__["う"]=-640;UW4__["え"]=-2514;UW4__["お"]=2405;UW4__["か"]=530;UW4__["が"]=6006;UW4__["き"]=-4482;UW4__["ぎ"]=-3821;UW4__["く"]=-3788;UW4__["け"]=-4376;UW4__["げ"]=-4734;UW4__["こ"]=2255;UW4__["ご"]=1979;UW4__["さ"]=2864;UW4__["し"]=-843;UW4__["じ"]=-2506;UW4__["す"]=-731;UW4__["ず"]=1251;UW4__["せ"]=181;UW4__["そ"]=4091;UW4__["た"]=5034;UW4__["だ"]=5408;UW4__["ち"]=-3654;UW4__["っ"]=-5882;UW4__["つ"]=-1659;UW4__["て"]=3994;UW4__["で"]=7410;UW4__["と"]=4547;UW4__["な"]=5433;UW4__["に"]=6499;UW4__["ぬ"]=1853;UW4__["ね"]=1413;UW4__["の"]=7396;UW4__["は"]=8578;UW4__["ば"]=1940;UW4__["ひ"]=4249;UW4__["び"]=-4134;UW4__["ふ"]=1345;UW4__["へ"]=6665;UW4__["べ"]=-744;UW4__["ほ"]=1464;UW4__["ま"]=1051;UW4__["み"]=-2082;UW4__["む"]=-882;UW4__["め"]=-5046;UW4__["も"]=4169;UW4__["ゃ"]=-2666;UW4__["や"]=2795;UW4__["ょ"]=-1544;UW4__["よ"]=3351;UW4__["ら"]=-2922;UW4__["り"]=-9726;UW4__["る"]=-14896;UW4__["れ"]=-2613;UW4__["ろ"]=-4570;UW4__["わ"]=-1783;UW4__["を"]=13150;UW4__["ん"]=-2352;UW4__["カ"]=2145;UW4__["コ"]=1789;UW4__["セ"]=1287;UW4__["ッ"]=-724;UW4__["ト"]=-403;UW4__["メ"]=-1635;UW4__["ラ"]=-881;UW4__["リ"]=-541;UW4__["ル"]=-856;UW4__["ン"]=-3637;UW4__["・"]=-4371;UW4__["ー"]=-11870;UW4__["一"]=-2069;UW4__["中"]=2210;UW4__["予"]=782;UW4__["事"]=-190;UW4__["井"]=-1768;UW4__["人"]=1036;UW4__["以"]=544;UW4__["会"]=950;UW4__["体"]=-1286;UW4__["作"]=530;UW4__["側"]=4292;UW4__["先"]=601;UW4__["党"]=-2006;UW4__["共"]=-1212;UW4__["内"]=584;UW4__["円"]=788;UW4__["初"]=1347;UW4__["前"]=1623;UW4__["副"]=3879;UW4__["力"]=-302;UW4__["動"]=-740;UW4__["務"]=-2715;UW4__["化"]=776;UW4__["区"]=4517;UW4__["協"]=1013;UW4__["参"]=1555;UW4__["合"]=-1834;UW4__["和"]=-681;UW4__["員"]=-910;UW4__["器"]=-851;UW4__["回"]=1500;UW4__["国"]=-619;UW4__["園"]=-1200;UW4__["地"]=866;UW4__["場"]=-1410;UW4__["塁"]=-2094;UW4__["士"]=-1413;UW4__["多"]=1067;
		UW4__["大"]=571;UW4__["子"]=-4802;UW4__["学"]=-1397;UW4__["定"]=-1057;UW4__["寺"]=-809;UW4__["小"]=1910;UW4__["屋"]=-1328;UW4__["山"]=-1500;UW4__["島"]=-2056;UW4__["川"]=-2667;UW4__["市"]=2771;UW4__["年"]=374;UW4__["庁"]=-4556;UW4__["後"]=456;UW4__["性"]=553;UW4__["感"]=916;UW4__["所"]=-1566;UW4__["支"]=856;UW4__["改"]=787;UW4__["政"]=2182;UW4__["教"]=704;UW4__["文"]=522;UW4__["方"]=-856;UW4__["日"]=1798;UW4__["時"]=1829;UW4__["最"]=845;UW4__["月"]=-9066;UW4__["木"]=-485;UW4__["来"]=-442;UW4__["校"]=-360;UW4__["業"]=-1043;UW4__["氏"]=5388;UW4__["民"]=-2716;UW4__["気"]=-910;UW4__["沢"]=-939;UW4__["済"]=-543;UW4__["物"]=-735;UW4__["率"]=672;UW4__["球"]=-1267;UW4__["生"]=-1286;UW4__["産"]=-1101;UW4__["田"]=-2900;UW4__["町"]=1826;UW4__["的"]=2586;UW4__["目"]=922;UW4__["省"]=-3485;UW4__["県"]=2997;UW4__["空"]=-867;UW4__["立"]=-2112;UW4__["第"]=788;UW4__["米"]=2937;UW4__["系"]=786;UW4__["約"]=2171;UW4__["経"]=1146;UW4__["統"]=-1169;UW4__["総"]=940;UW4__["線"]=-994;UW4__["署"]=749;UW4__["者"]=2145;UW4__["能"]=-730;UW4__["般"]=-852;UW4__["行"]=-792;UW4__["規"]=792;UW4__["警"]=-1184;UW4__["議"]=-244;UW4__["谷"]=-1000;UW4__["賞"]=730;UW4__["車"]=-1481;UW4__["軍"]=1158;UW4__["輪"]=-1433;UW4__["込"]=-3370;UW4__["近"]=929;UW4__["道"]=-1291;UW4__["選"]=2596;UW4__["郎"]=-4866;UW4__["都"]=1192;UW4__["野"]=-1100;UW4__["銀"]=-2213;UW4__["長"]=357;UW4__["間"]=-2344;UW4__["院"]=-2297;UW4__["際"]=-2604;UW4__["電"]=-878;UW4__["領"]=-1659;UW4__["題"]=-792;UW4__["館"]=-1984;UW4__["首"]=1749;UW4__["高"]=2120;UW4__["｢"]=1895;UW4__["｣"]=3798;UW4__["･"]=-4371;UW4__["ｯ"]=-724;UW4__["ｰ"]=-11870;UW4__["ｶ"]=2145;UW4__["ｺ"]=1789;UW4__["ｾ"]=1287;UW4__["ﾄ"]=-403;UW4__["ﾒ"]=-1635;UW4__["ﾗ"]=-881;UW4__["ﾘ"]=-541;UW4__["ﾙ"]=-856;UW4__["ﾝ"]=-3637;
	UW5__[","]=465;UW5__["."]=-299;UW5__["1"]=-514;UW5__["E2"]=-32768;UW5__["]"]=-2762;UW5__["、"]=465;UW5__["。"]=-299;UW5__["「"]=363;UW5__["あ"]=1655;UW5__["い"]=331;UW5__["う"]=-503;UW5__["え"]=1199;UW5__["お"]=527;UW5__["か"]=647;UW5__["が"]=-421;UW5__["き"]=1624;UW5__["ぎ"]=1971;UW5__["く"]=312;UW5__["げ"]=-983;UW5__["さ"]=-1537;UW5__["し"]=-1371;UW5__["す"]=-852;UW5__["だ"]=-1186;UW5__["ち"]=1093;UW5__["っ"]=52;UW5__["つ"]=921;UW5__["て"]=-18;UW5__["で"]=-850;UW5__["と"]=-127;UW5__["ど"]=1682;UW5__["な"]=-787;UW5__["に"]=-1224;UW5__["の"]=-635;UW5__["は"]=-578;UW5__["べ"]=1001;UW5__["み"]=502;UW5__["め"]=865;UW5__["ゃ"]=3350;UW5__["ょ"]=854;UW5__["り"]=-208;UW5__["る"]=429;UW5__["れ"]=504;UW5__["わ"]=419;UW5__["を"]=-1264;UW5__["ん"]=327;UW5__["イ"]=241;UW5__["ル"]=451;UW5__["ン"]=-343;UW5__["中"]=-871;UW5__["京"]=722;UW5__["会"]=-1153;UW5__["党"]=-654;UW5__["務"]=3519;UW5__["区"]=-901;UW5__["告"]=848;UW5__["員"]=2104;UW5__["大"]=-1296;UW5__["学"]=-548;UW5__["定"]=1785;UW5__["嵐"]=-1304;UW5__["市"]=-2991;UW5__["席"]=921;UW5__["年"]=1763;UW5__["思"]=872;UW5__["所"]=-814;UW5__["挙"]=1618;UW5__["新"]=-1682;UW5__["日"]=218;UW5__["月"]=-4353;UW5__["査"]=932;UW5__["格"]=1356;UW5__["機"]=-1508;UW5__["氏"]=-1347;UW5__["田"]=240;UW5__["町"]=-3912;UW5__["的"]=-3149;UW5__["相"]=1319;UW5__["省"]=-1052;UW5__["県"]=-4003;UW5__["研"]=-997;UW5__["社"]=-278;UW5__["空"]=-813;UW5__["統"]=1955;UW5__["者"]=-2233;UW5__["表"]=663;UW5__["語"]=-1073;UW5__["議"]=1219;UW5__["選"]=-1018;UW5__["郎"]=-368;UW5__["長"]=786;UW5__["間"]=1191;UW5__["題"]=2368;UW5__["館"]=-689;UW5__["１"]=-514;UW5__["Ｅ２"]=-32768;UW5__["｢"]=363;UW5__["ｲ"]=241;UW5__["ﾙ"]=451;UW5__["ﾝ"]=-343;
	UW6__[","]=227;UW6__["."]=808;UW6__["1"]=-270;UW6__["E1"]=306;UW6__["、"]=227;UW6__["。"]=808;UW6__["あ"]=-307;UW6__["う"]=189;UW6__["か"]=241;UW6__["が"]=-73;UW6__["く"]=-121;UW6__["こ"]=-200;UW6__["じ"]=1782;UW6__["す"]=383;UW6__["た"]=-428;UW6__["っ"]=573;UW6__["て"]=-1014;UW6__["で"]=101;UW6__["と"]=-105;UW6__["な"]=-253;UW6__["に"]=-149;UW6__["の"]=-417;UW6__["は"]=-236;UW6__["も"]=-206;UW6__["り"]=187;UW6__["る"]=-135;UW6__["を"]=195;UW6__["ル"]=-673;UW6__["ン"]=-496;UW6__["一"]=-277;UW6__["中"]=201;UW6__["件"]=-800;UW6__["会"]=624;UW6__["前"]=302;UW6__["区"]=1792;UW6__["員"]=-1212;UW6__["委"]=798;UW6__["学"]=-960;UW6__["市"]=887;UW6__["広"]=-695;UW6__["後"]=535;UW6__["業"]=-697;UW6__["相"]=753;UW6__["社"]=-507;UW6__["福"]=974;UW6__["空"]=-822;UW6__["者"]=1811;UW6__["連"]=463;UW6__["郎"]=1082;UW6__["１"]=-270;UW6__["Ｅ１"]=306;UW6__["ﾙ"]=-673;UW6__["ﾝ"]=-496;

#ifdef ENABLE_ENGINE_FIX
	BC2__["NN"] = -9999;//数字がきられてしまう問題への対処.
	TC2__["NNN"]=-9999;	//数字がきられてしまう問題への対処.
	TC3__["NNN"]=-9999;	//数字がきられてしまう問題への対処.
	UW3__["。"]=9999;	//。できられないときがあるので追加
#endif
}

TinySegmenter::~TinySegmenter()
{
}


//文字を unsigned long にする.
unsigned long TinySegmenter::stringToULong(const char * p) const
{
	ASSERT(*p != '\0');

	if (*(p + 1) == 0)
	{
		return *(unsigned char*)p;
	}
	if (*(p + 2) == 0)
	{
		return ((*(unsigned char*)(p + 0)) << 8) + ((*(unsigned char*)(p + 1)) );
	}
	if (*(p + 3) == 0)
	{
		return ((*(unsigned char*)(p + 0)) << 16) + ((*(unsigned char*)(p + 1)) << 8) + ((*(unsigned char*)(p + 2)) ) ;
	}
	return ((*(unsigned char*)(p + 0)) << 24) + ((*(unsigned char*)(p + 1)) << 16) + 
					((*(unsigned char*)(p + 2)) << 8) + ((*(unsigned char*)(p + 3)) );

}

std::string TinySegmenter::ctype_(const std::string & str) const
{
	unsigned long c = stringToULong(str.c_str());	//utf8があるとイヤなんで unsigned longで.

//	this->Pattern[Pattern_M].CreatePattern("[一二三四五六七八九十百千万億兆]");
	unsigned long Pattern_MArray[] = { '一','二','三','四','五','六','七','八','九'
					,'十','百','千','万','億','兆' , 0};
	for (unsigned long * Pattern_MArrayP = Pattern_MArray ; *Pattern_MArrayP ; Pattern_MArrayP++ )
	{
		if (c == *Pattern_MArrayP)
		{
			return "M";
		}
	}

	//	this->Pattern[Pattern_H].CreatePattern("[一-龠々〆ヵヶ]");
//	if (c >= (unsigned long)'一' && c <= (unsigned long)'龠')
	if (c >= (unsigned long)'亜' && c <= (unsigned long)'黑')	//sjisだと漢字コードの範囲がちょっと違う
	{
		return "H";
	}
	if (c == (unsigned long)'々' || c == (unsigned long)'〆' || c == (unsigned long)'ヵ' || c == (unsigned long)'ヶ')
	{
		return "H";
	}

	//	this->Pattern[Pattern_I].CreatePattern("[ぁ-ん]");
	if (c >= (unsigned long)'ぁ' && c <= (unsigned long)'ん')
	{
		return "I";
	}

	//	this->Pattern[Pattern_K].CreatePattern("[ァ-ヴーｱ-ﾝﾞｰ]");
	if ((c >= ((unsigned long)'ァ') && c <= ((unsigned long)'ヴ') ) || 
		(c >= ((unsigned long)(unsigned char)'ｱ')  && c <= ((unsigned long)(unsigned char)'ﾝ') ) || 
		(c == ((unsigned long)'ー') || c == ((unsigned long)(unsigned char)'ﾞ') || c == (unsigned long)(unsigned char)'ｰ' ) )
	{
		return "K";
	}

	//	this->Pattern[Pattern_A].CreatePattern("[a-zA-Zａ-ｚＡ-Ｚ]");
	if ((c >= 'a' && c <= 'z') || 
		(c >= 'A' && c <= 'Z') || 
		(c >= (unsigned long)'ａ' && c <= (unsigned long)'ｚ') || 
		(c >= (unsigned long)'Ａ' && c <= (unsigned long)'Ｚ')  )
	{
		return "A";
	}

//	this->Pattern[Pattern_N].CreatePattern("[0-9０-９]");
	if ((c >= '0' && c <= '9') || 
		(c >= (unsigned long)'０' && c <= (unsigned long)'９')  )
	{
		return "N";
	}
#ifdef ENABLE_ENGINE_FIX
	//小数点も数字として認識する.
	if ((c == '.') )
	{
		return "N";
	}
#endif

	return "O";
}


bool TinySegmenter::segment(const std::string & input , XLStringList * result) 
{
	result->clear();
	if(input.size() <= 0)
	{
		return false;
	}

	XLStringList seg;
	seg.push_back("B3"); seg.push_back("B2"); seg.push_back("B1");

	XLStringList ctype;
	ctype.push_back("O"); ctype.push_back("O"); ctype.push_back("O");

	for (const char * p = input.c_str() ; *p ; p++ )
	{
		std::string r ;
		if (issjiskanji(*p))
		{
			r = std::string(p , 0 , 2);
			p++;
		}
		else
		{
			r = std::string(p,0,1);
		}
		seg.push_back(r);
		ctype.push_back(ctype_(r));
	}

	seg.push_back("E1");	seg.push_back("E2");	seg.push_back("E3");
	ctype.push_back("O");	ctype.push_back("O");	ctype.push_back("O");

	std::string	word = seg[3];
	std::string	p1 = "U";
	std::string	p2 = "U";
	std::string	p3 = "U";
	
	int loop = seg.size() - 3;
	for(int i = 4 ; i < loop ; i++ )
	{
		int score = this->BIAS__;
		std::string w1 = seg[i-3];
		std::string w2 = seg[i-2];
		std::string w3 = seg[i-1];
		std::string w4 = seg[i];
		std::string w5 = seg[i+1];
		std::string w6 = seg[i+2];
		std::string c1 = ctype[i-3];
		std::string c2 = ctype[i-2];
		std::string c3 = ctype[i-1];
		std::string c4 = ctype[i];
		std::string c5 = ctype[i+1];
		std::string c6 = ctype[i+2];
		score += this->UP1__[p1];
		score += this->UP2__[p2];
		score += this->UP3__[p3];
		score += this->BP1__[p1 + p2];
		score += this->BP2__[p2 + p3];
		score += this->UW1__[w1];
		score += this->UW2__[w2];
		score += this->UW3__[w3];
		score += this->UW4__[w4];
		score += this->UW5__[w5];
		score += this->UW6__[w6];
		score += this->BW1__[w2 + w3];
		score += this->BW2__[w3 + w4];
		score += this->BW3__[w4 + w5];
		score += this->TW1__[w1 + w2 + w3];
		score += this->TW2__[w2 + w3 + w4];
		score += this->TW3__[w3 + w4 + w5];
		score += this->TW4__[w4 + w5 + w6];
		score += this->UC1__[c1];
		score += this->UC2__[c2];
		score += this->UC3__[c3];
		score += this->UC4__[c4];
		score += this->UC5__[c5];
		score += this->UC6__[c6];
		score += this->BC1__[c2 + c3];
		score += this->BC2__[c3 + c4];
		score += this->BC3__[c4 + c5];
		score += this->TC1__[c1 + c2 + c3];
		score += this->TC2__[c2 + c3 + c4];
		score += this->TC3__[c3 + c4 + c5];
		score += this->TC4__[c4 + c5 + c6];
		//  score += this->TC5__[c4 + c5 + c6];
		score += this->UQ1__[p1 + c1];
		score += this->UQ2__[p2 + c2];
		score += this->UQ1__[p3 + c3];
		score += this->BQ1__[p2 + c2 + c3];
		score += this->BQ2__[p2 + c3 + c4];
		score += this->BQ3__[p3 + c2 + c3];
		score += this->BQ4__[p3 + c3 + c4];
		score += this->TQ1__[p2 + c1 + c2 + c3];
		score += this->TQ2__[p2 + c2 + c3 + c4];
		score += this->TQ3__[p3 + c1 + c2 + c3];
		score += this->TQ4__[p3 + c2 + c3 + c4];
		std::string p = "O";
		if(score > 0){
			result->push_back(word);
			word = "";
			p = "B";
		}
		p1 = p2;
		p2 = p3;
		p3 = p;
		word += seg[i];
	}
	result->push_back(word);
	return true;
}


void TinySegmenter::test()
{
	{
		//文字コードマッチのテスト
		unsigned long r;
		TinySegmenter ts;

		ASSERT( (r = ts.stringToULong("あ")) == 0x82A0);
		ASSERT( (r = ts.stringToULong("A")) == 65);

	}
	{
		//文字カテゴリ変換のテスト
		string r;
		TinySegmenter ts;
		ASSERT( (r = ts.ctype_("ｶ")) ==  "K");
		ASSERT( (r = ts.ctype_("A")) == "A");
		ASSERT( (r = ts.ctype_("1")) == "N");
		ASSERT( (r = ts.ctype_("あ")) == "I");
		ASSERT( (r = ts.ctype_("山")) == "H");
		ASSERT( (r = ts.ctype_("川")) == "H");
		ASSERT( (r = ts.ctype_("ヴ")) == "K");
		ASSERT( (r = ts.ctype_("五")) == "M");
		ASSERT( (r = ts.ctype_("㌔")) == "O");
		ASSERT( (r = ts.ctype_("。")) == "O");
		ASSERT( (r = ts.ctype_("、")) == "O");
		ASSERT( (r = ts.ctype_("安")) == "H");
		ASSERT( (r = ts.ctype_("全")) == "H");
	}
	{
		//数字のパースがうまくいかない件のfix
		TinySegmenter ts;
		XLStringList slist;
		std::string r;
#ifdef ENABLE_ENGINE_FIX
		{
			//少数のご認識を回避
			ts.segment("1.5", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 1);
			ASSERT((r = *it) == "1.5");	it++;
		}
		{
			//ピリオドがあると悩ましいがうまくいくはず
			ts.segment("hello world.", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 3);
			ASSERT((r = *it) == "hello");	it++;
			ASSERT((r = *it) == " world");	it++;
			ASSERT((r = *it) == ".");	it++;
		}
		{
			ts.segment("65535", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 1);
			ASSERT((r = *it) == "65535");	it++;
		}
		{
			ts.segment("1024", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 1);
			ASSERT((r = *it) == "1024");	it++;
		}
		{
			ts.segment("256", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 1);
			ASSERT((r = *it) == "256");	it++;
		}
		{
			ts.segment("1.5GB", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 2);
			ASSERT((r = *it) == "1.5");	it++;
			ASSERT((r = *it) == "GB");	it++;
		}
#endif
		{
			//もちろん英語はちゃんと動く
			ts.segment("hello", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 1);
			ASSERT((r = *it) == "hello");	it++;
		}
		{
			//日本語もOK
			ts.segment("テスト", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 1);
			ASSERT((r = *it) == "テスト");	it++;

		}
		//漢字の範囲を間違っていたので安全 が 安 | 全 となってしまっていたので修正
		{
			ts.segment("全てクライアントサイドで解析を行うため、セキュリティの観点から見ても安全です。分かち書きの単位はMeCab + ipadicと互換性があります。", &slist);
			XLStringList::iterator it = slist.begin();
			ASSERT(slist.size() == 35);
			ASSERT((r = *it) == "全");	it++;
			ASSERT((r = *it) == "て");	it++;
			ASSERT((r = *it) == "クライアントサイド");	it++;
			ASSERT((r = *it) == "で");	it++;
			ASSERT((r = *it) == "解析");	it++;
			ASSERT((r = *it) == "を");	it++;
			ASSERT((r = *it) == "行う");	it++;
			ASSERT((r = *it) == "ため");	it++;
			ASSERT((r = *it) == "、");	it++;
			ASSERT((r = *it) == "セキュリティ");	it++;
			ASSERT((r = *it) == "の");	it++;
			ASSERT((r = *it) == "観点");	it++;
			ASSERT((r = *it) == "から");	it++;
			ASSERT((r = *it) == "見");	it++;
			ASSERT((r = *it) == "て");	it++;
			ASSERT((r = *it) == "も");	it++;
			ASSERT((r = *it) == "安全");	it++;
			ASSERT((r = *it) == "です");	it++;
			ASSERT((r = *it) == "。");	it++;
			ASSERT((r = *it) == "分かち");	it++;
			ASSERT((r = *it) == "書き");	it++;
			ASSERT((r = *it) == "の");	it++;
			ASSERT((r = *it) == "単位");	it++;
			ASSERT((r = *it) == "は");	it++;
			ASSERT((r = *it) == "MeCab");	it++;
			ASSERT((r = *it) == " +");	it++;
			ASSERT((r = *it) == " ");	it++;
			ASSERT((r = *it) == "ipadic");	it++;
			ASSERT((r = *it) == "と");	it++;
			ASSERT((r = *it) == "互換");	it++;
			ASSERT((r = *it) == "性");	it++;
			ASSERT((r = *it) == "が");	it++;
			ASSERT((r = *it) == "あり");	it++;
			ASSERT((r = *it) == "ます");	it++;
			ASSERT((r = *it) == "。");	it++;
		}
	}
	{
		//パーステスト
		TinySegmenter ts;
		XLStringList slist;
		ts.segment("科学の力ではどうしようもできない、魑魅魍魎などの奇怪な輩に立ち向かう胡散臭い男。", &slist);
		XLStringList::iterator it = slist.begin();
		std::string r;

		ASSERT(slist.size() == 25);
		ASSERT((r = *it) == "科学");	it++;
		ASSERT((r = *it) == "の");	it++;
		ASSERT((r = *it) == "力");	it++;
		ASSERT((r = *it) == "で");	it++;
		ASSERT((r = *it) == "は");	it++;
		ASSERT((r = *it) == "どう");	it++;
		ASSERT((r = *it) == "しよ");	it++;
		ASSERT((r = *it) == "う");	it++;
		ASSERT((r = *it) == "も");	it++;
		ASSERT((r = *it) == "でき");	it++;
		ASSERT((r = *it) == "ない");	it++;
		ASSERT((r = *it) == "、");	it++;
		ASSERT((r = *it) == "魑魅");	it++;
		ASSERT((r = *it) == "魍魎");	it++;
		ASSERT((r = *it) == "など");	it++;
		ASSERT((r = *it) == "の");	it++;
		ASSERT((r = *it) == "奇怪");	it++;
		ASSERT((r = *it) == "な");	it++;
		ASSERT((r = *it) == "輩");	it++;
		ASSERT((r = *it) == "に");	it++;
		ASSERT((r = *it) == "立ち向かう");	it++;
		ASSERT((r = *it) == "胡散");	it++;
		ASSERT((r = *it) == "臭い");	it++;
		ASSERT((r = *it) == "男");	it++;
		ASSERT((r = *it) == "。");	it++;
	}
}
